# 200222 08:09
# 데이터 사이언스
# Pandas
# B mo님 답변 너무 잘해주신다. 강의 듣고 답변 꼭 확인하면서 진행하기

import pandas as pd
iphone_df = pd.read_csv(r'C:\Users\hayong\Downloads\iphone.csv', index_col=0)
print(iphone_df)

print()
print(type(iphone_df))

# 문자열 앞에 'r'을 붙이던지(문자열을 해석하지 않고 raw로 읽기 위한 지시자)
# \\ 두개 하던지
# / 로 바꾸던지

# 모든 건 검색이다
# 프로그래머는 검색이 곧 무기다
# 검색으로 승리하자
# 반복을 통한 숙달
# 여러 강의를 들어서 경험치 먹어놔야 레벨업 함
# 이후는 숙달하고, 스스로 프로그램 만들어보고
# 남의 코드 잘 살펴보고
# 지식 넣고, 잘 빼서 쓸 수 있는 능력 기르고
# 고시공부랑 똑같은 듯
# 세상 모든 공부가 안그러겠냐만은
# 정말 간절하게 열심히 잘 공부하자
# 파이썬 주니어 개발자 정하용 화이팅! 취직하자!

# 영어공부 필수!
# 운동 필수!
# 정보찾기왕 공부 필수!
# 금융, 경제 공부 필수!